
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Объект.Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВсеНаСервере(КолВоЗаписей)
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
    ОбрОбъект.Загрузить(КолВоЗаписей);
    ЗначениеВРеквизитФормы(ОбрОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВсе(Команда)	
	Хорошо = ПроверитьЗаполнение();
	Если НЕ Хорошо Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Период.ДатаНачала > Объект.Период.ДатаОкончания Тогда
		Предупреждение("Неправильный период");
		Возврат;
	КонецЕсли;
 	КолВоЗаписей = 0;
	ВыполнитьВсеНаСервере(КолВоЗаписей);
	Если КолВоЗаписей = 0 Тогда
	    ПоказатьОповещениеПользователя("Не загружено ни одного курса ЦБ валюты "+Объект.Валюта);
	Иначе
		ПоказатьОповещениеПользователя("Загружено "+Формат(КолВоЗаписей, "ЧГ=3,0")+" курсов ЦБ валюты "+Объект.Валюта);	
	КонецЕсли;
	Оповестить("ОбновилисьВалютыИлиКурсы");
КонецПроцедуры


